TODO.org
* Tasks

** DONE Add a key binding to turn on/off the minor mode
   :LOGBOOK:
   - State "TODO"        ->  "DONE"       [2013-10-12 Sat 09:47]
   :END:

Added =C-+= to toggle AUCKeys on/off.

** DONE Re-enable default Org key bindings with =C-u=
   :LOGBOOK:
   - State "TODO"        ->  "DONE"       [2013-10-21 Mon 21:55]
   :END:

So, =C-c C-s= will insert a new heading when AUCKeys in enabled, but =C-u C-c C-s=
would call the standard Org =C-c C-s= function.

See http://stackoverflow.com/questions/19338494/how-to-call-original-function-with-one-less-c-u

** DONE Make a AUCTeX-like export dispatcher
   :LOGBOOK:
   - State "TODO"        ->  "DONE"       [2013-10-12 Sat 10:34]
   :END:

Just two commands would be sufficient:

- Export, if no PDF or if PDF is older than Org source file
- View, if PDF is newer than Org source file

(And =C-u C-c C-e= would call the original export dispatcher.)
