TODO.html
<!-- <xml version="1.0"> -->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />

  <title>TODO</title><!-- 2013-10-12 Sat 10:39 -->
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta name="generator" content="Org-mode" />
  <meta name="author" content="Fabrice Niessen" />
</head>

<body>
  <div id="content">
    <h1 class="title">TODO</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#sec-1">1. Tasks</a>

            <ul>
              <li><a href="#sec-1-1">1.1. Add a key binding to turn on/off the
              minor mode</a></li>

              <li><a href="#sec-1-2">1.2. Re-enable default Org key bindings
              with <code>C-u</code></a></li>

              <li><a href="#sec-1-3">1.3. Make a AUCTeX-like export
              dispatcher</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-sec-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> Tasks</h2>

      <div class="outline-text-2" id="text-1"></div>

      <div id="outline-container-sec-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class=
        "done DONE">DONE</span> Add a key binding to turn on/off the minor
        mode</h3>

        <div class="outline-text-3" id="text-1-1">
          <p>Added <code>C-+</code> to toggle AUCKeys on/off.</p>
        </div>
      </div>

      <div id="outline-container-sec-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class=
        "todo TODO">TODO</span> Re-enable default Org key bindings with
        <code>C-u</code></h3>

        <div class="outline-text-3" id="text-1-2">
          <p>So, <code>C-c C-s</code> will insert a new heading when AUCKeys in
          enabled, but <code>C-u C-c C-s</code> would call the standard Org
          <code>C-c C-s</code> function.</p>
        </div>
      </div>

      <div id="outline-container-sec-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class=
        "done DONE">DONE</span> Make a AUCTeX-like export dispatcher</h3>

        <div class="outline-text-3" id="text-1-3">
          <p>Just two commands would be sufficient:</p>

          <ul class="org-ul">
            <li>Export, if no PDF or if PDF is older than Org source file</li>

            <li>View, if PDF is newer than Org source file</li>
          </ul>

          <p>(And <code>C-u C-c C-e</code> would call the original export
          dispatcher.)</p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <div id="copyright">
      © Fabrice Niessen
    </div>
  </div>
</body>
</html>
